# ComboBoxDropDownOpenedEventArgs Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ComboBoxDropDownOpenedEventArgs Class
Members See Also
---
The event arguments used by ComboBox's DropDownOpened event.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class ComboBoxDropDownOpenedEventArgs : RibbonItemEventArgs
```

Visual Basic
---
```text
Public Class ComboBoxDropDownOpenedEventArgs _
	Inherits RibbonItemEventArgs
```

Visual C++
---
```text
public ref class ComboBoxDropDownOpenedEventArgs : public RibbonItemEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.UI.Events..::..RibbonItemEventArgs Autodesk.Revit.UI.Events..::..ComboBoxDropDownOpenedEventArgs
# See Also
ComboBoxDropDownOpenedEventArgs Members
Autodesk.Revit.UI.Events Namespace